In [78]:
%%html
<h1 align="center">STUDENT PERFOMANCE ANALYSIS</h1>

In [79]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import seaborn as sns
%matplotlib inline

In [80]:
df=pd.read_csv("C:\\Users\\hp\Downloads\\StudentsPerformance.csv")
df

,gender,group,level,lunch,prep,math score,reading score,writing score
0,female,B,bachelors,standard,none,72,72,74
1,female,C,bachelors,standard,completed,69,90,88
2,female,B,masters,standard,none,90,95,93
3,male,A,bachelors,free,none,47,57,44
4,male,C,bachelors,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,E,masters,standard,completed,88,99,95
996,male,C,high school,free,none,62,55,55
997,female,C,high school,free,completed,59,71,65
998,female,D,bachelors,standard,completed,68,78,77
999,female,D,bachelors,free,none,77,86,86

In [81]:
df.shape

(1000, 8)

In [82]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
gender           1000 non-null object
group            1000 non-null object
level            1000 non-null object
lunch            1000 non-null object
prep             1000 non-null object
math score       1000 non-null int64
reading score    1000 non-null int64
writing score    1000 non-null int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [83]:
df.columns

Index(['gender', 'group', 'level', 'lunch', 'prep', 'math score',
       'reading score', 'writing score'],
      dtype='object')

In [84]:
df.head()

,gender,group,level,lunch,prep,math score,reading score,writing score
0,female,B,bachelors,standard,none,72,72,74
1,female,C,bachelors,standard,completed,69,90,88
2,female,B,masters,standard,none,90,95,93
3,male,A,bachelors,free,none,47,57,44
4,male,C,bachelors,standard,none,76,78,75

In [85]:
#renaming

In [86]:
df = df.rename(columns ={"race/ethnicity":"group","parental level of education":"level","test preparation course":"prep" })

In [87]:
df.head()

,gender,group,level,lunch,prep,math score,reading score,writing score
0,female,B,bachelors,standard,none,72,72,74
1,female,C,bachelors,standard,completed,69,90,88
2,female,B,masters,standard,none,90,95,93
3,male,A,bachelors,free,none,47,57,44
4,male,C,bachelors,standard,none,76,78,75

In [88]:
#basic preprocessing

In [89]:
df.gender.unique()

array(['female', 'male'], dtype=object)

In [90]:
df.group.unique()

array(['B', 'C', 'A', 'D', 'E'], dtype=object)

In [91]:
df.level.unique()

array(['bachelors', 'masters', 'high school'], dtype=object)

In [92]:
df.lunch.unique()

array(['standard', 'free'], dtype=object)

In [93]:
df.prep.unique()

array(['none', 'completed'], dtype=object)

In [94]:
df.lunch =df.lunch.apply(lambda x:"free" if x=="free/reduced" else x)
df.head()

,gender,group,level,lunch,prep,math score,reading score,writing score
0,female,B,bachelors,standard,none,72,72,74
1,female,C,bachelors,standard,completed,69,90,88
2,female,B,masters,standard,none,90,95,93
3,male,A,bachelors,free,none,47,57,44
4,male,C,bachelors,standard,none,76,78,75

In [95]:
df.level= df.level.replace("bachelor's degree","bachelors").replace("master's degree","masters").replace("associate's degree","bachelors").replace("some college","bachelors").replace("some high school","high school")
df.head()

,gender,group,level,lunch,prep,math score,reading score,writing score
0,female,B,bachelors,standard,none,72,72,74
1,female,C,bachelors,standard,completed,69,90,88
2,female,B,masters,standard,none,90,95,93
3,male,A,bachelors,free,none,47,57,44
4,male,C,bachelors,standard,none,76,78,75

In [96]:
df.group= df.group.apply(lambda x:x.split(' ')[-1])
df.head()

,gender,group,level,lunch,prep,math score,reading score,writing score
0,female,B,bachelors,standard,none,72,72,74
1,female,C,bachelors,standard,completed,69,90,88
2,female,B,masters,standard,none,90,95,93
3,male,A,bachelors,free,none,47,57,44
4,male,C,bachelors,standard,none,76,78,75

In [97]:
df.to_csv("C:\\Users\\hp\Downloads\\StudentsPerformance.csv",index =False)